drop database if exists library;
create database library;

use library;

create table book(
name varchar(120) not null,
description varchar(240) default 'Description is empty',
publish_date date not null default '2018-01-01',
author varchar(60) not null,
category varchar(30) not null
);

insert into book(name, description, publish_date, author, category)
VALUES
('451 по Фаренгейту', 'Магический реализм его прозы, рукотворные механизмы радости, переносящие человека из настоящего в волшебные миры детства.', '1953-10-19', 'Рей Бредбері', 'Наукова фантастика'),
('1984', 'Головний герой, Вінстон Сміт, живе в Лондоні, працює в Міністерстві Правди і є членом Зовнішньої Партії.', '1949-06-08', 'Джордж Орвелл', 'Політична художня'),
('Майстер і Маргарита', null, '1966-01-01', 'Михайло Опанасович Булгаков', 'Детектив'),
('Шантарам', null, '2003-01-01', 'Ґреґорі Девід Робертс', 'роман'),
('Квіти для Елджернона', 'Головний герой — Чарлі Гордон, 37-річний чоловік з розумовою неповносправністю, який працює прибиральником на фабриці з виробництва пластикової тари', '1966-04-01', 'Деніел Кіз', 'Роман'),
('Портрет Доріана Грея', null, '1890-07-01', 'Оскар Уайльд', 'Готична художня література'),
('Маленький принц', 'Пілот здійснює вимушену посадку в пустелі Сахара і зустрічає одного незвичайного та загадкового хлопчика — принца з іншої планети — астероїда B-612', '1943-04-06', 'Антуан де Сент-Екзюпері', 'Дитяча література,'),
('Анна Кареніна', 'Основний конфлікт роману розвивається на прикладі кількох сімейних пар: Анна − Каренін, Долі − Облонський, Кіті − Левін', '1876-01-01', 'Лев Миколайович Толстой', 'соціально-психологічний роман'),
('Злочин і кара', null, '1866-01-01', 'Федір Михайлович Достоєвський', 'Психологічний реалізм');